
/**********************************************************************************//**
	@file           ManualTest_HashTable.h
	@brief          手動テスト
*//***********************************************************************************/
#pragma once

//--------------------------------------------------------------------------------
// マクロ定義
//--------------------------------------------------------------------------------

// コンパイルが通れば成功 
//#define GET_SIZE_WHEN_CONST
//#define FIND_WHEN_CONST

// コンパイルが通らなければ成功
//#define IRREGULAR_HASH_FUNC
//#define INSERT_WHEN_CONST
//#define ERASE_WHEN_CONST

